In [1]:
import numpy as np
import pandas as pd

nls97 = pd.read_csv("data/nls97.csv")
nls97.set_index("personid", inplace=True)
nls97.shape

(8984, 88)

In [2]:
nls97.head()

,gender,birthmonth,birthyear,highestgradecompleted,maritalstatus,childathome,childnotathome,wageincome,weeklyhrscomputer,weeklyhrstv,...,colenrfeb13,colenroct13,colenrfeb14,colenroct14,colenrfeb15,colenroct15,colenrfeb16,colenroct16,colenrfeb17,colenroct17
personid,,,,,,,,,,,,,,,,,,,,,
100061,Female,5,1980,13.0,Married,4.0,0.0,12500.0,10 hours or more a week,11 to 20 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
100139,Male,9,1983,12.0,Married,2.0,0.0,120000.0,1 to 3 hours a week,3 to 10 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
100284,Male,11,1984,7.0,Never-married,1.0,0.0,58000.0,None,11 to 20 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled
100292,Male,4,1982,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,NaN,NaN,NaN,NaN
100583,Male,1,1980,13.0,Married,4.0,0.0,30000.0,Less than 1 hour a week,3 to 10 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled

In [3]:
nls97.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8984 entries, 100061 to 999963
Data columns (total 88 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   gender                 8984 non-null   object
 1   birthmonth             8984 non-null   int64
 2   birthyear              8984 non-null   int64
 3   highestgradecompleted  6663 non-null   float64
 4   maritalstatus          6672 non-null   object
 5   childathome            4791 non-null   float64
 6   childnotathome         4791 non-null   float64
 7   wageincome             5091 non-null   float64
 8   weeklyhrscomputer      6710 non-null   object
 9   weeklyhrstv            6711 non-null   object
 10  nightlyhrssleep        6706 non-null   float64
 11  satverbal              1406 non-null   float64
 12  satmath                1407 non-null   float64
 13  gpaoverall             6004 non-null   float64
 14  gpaenglish             5798 non-null   float64
 15  gpamath                5766 non-null   float64
 16  gpascience             5684 non-null   float64
 17  highestdegree          8953 non-null   object
 18  govprovidejobs         1833 non-null   object
 19  govpricecontrols       1859 non-null   object
 20  govhealthcare          1874 non-null   object
 21  govelderliving         1872 non-null   object
 22  govindhelp             1815 non-null   object
 23  govunemp               1811 non-null   object
 24  govincomediff          1775 non-null   object
 25  govcollegefinance      1875 non-null   object
 26  govdecenthousing       1847 non-null   object
 27  govprotectenvironment  1860 non-null   object
 28  weeksworked00          8603 non-null   float64
 29  weeksworked01          8564 non-null   float64
 30  weeksworked02          8556 non-null   float64
 31  weeksworked03          8490 non-null   float64
 32  weeksworked04          8458 non-null   float64
 33  weeksworked05          8403 non-null   float64
 34  weeksworked06          8340 non-null   float64
 35  weeksworked07          8272 non-null   float64
 36  weeksworked08          8186 non-null   float64
 37  weeksworked09          8146 non-null   float64
 38  weeksworked10          8054 non-null   float64
 39  weeksworked11          7968 non-null   float64
 40  weeksworked12          7747 non-null   float64
 41  weeksworked13          7680 non-null   float64
 42  weeksworked14          7612 non-null   float64
 43  weeksworked15          7389 non-null   float64
 44  weeksworked16          7068 non-null   float64
 45  weeksworked17          6670 non-null   float64
 46  colenrfeb97            1250 non-null   object
 47  colenroct97            8501 non-null   object
 48  colenrfeb98            8501 non-null   object
 49  colenroct98            8888 non-null   object
 50  colenrfeb99            8865 non-null   object
 51  colenroct99            8851 non-null   object
 52  colenrfeb00            8820 non-null   object
 53  colenroct00            8805 non-null   object
 54  colenrfeb01            8786 non-null   object
 55  colenroct01            8758 non-null   object
 56  colenrfeb02            8732 non-null   object
 57  colenroct02            8698 non-null   object
 58  colenrfeb03            8658 non-null   object
 59  colenroct03            8622 non-null   object
 60  colenrfeb04            8578 non-null   object
 61  colenroct04            8546 non-null   object
 62  colenrfeb05            8508 non-null   object
 63  colenroct05            8471 non-null   object
 64  colenrfeb06            8426 non-null   object
 65  colenroct06            8407 non-null   object
 66  colenrfeb07            8352 non-null   object
 67  colenroct07            8331 non-null   object
 68  colenrfeb08            8289 non-null   object
 69  colenroct08            8280 non-null   object
 70  colenrfeb09            8236 non-null   object
 71  colenroct09            8193 non-null   object
 72  colenrfeb10            8116 non-null   object
 73  colenroct10            8091 non-null   object
 74  colenrfeb11            8037 non-null   object
 75  colenroct11            7972 non-null   object
 76  colenrfeb12            7794 non-null   object
 77  colenroct12            7754 non-null   object
 78  colenrfeb13            7754 non-null   object
 79  colenroct13            7754 non-null   object
 80  colenrfeb14            7624 non-null   object
 81  colenroct14            7469 non-null   object
 82  colenrfeb15            7469 non-null   object
 83  colenroct15            7469 non-null   object
 84  colenrfeb16            7036 non-null   object
 85  colenroct16            6733 non-null   object
 86  colenrfeb17            6733 non-null   object
 87  colenroct17            6734 non-null   object
dtypes: float64(29), int64(2), object(57)
memory usage: 6.1+ MB

In [4]:
nls97.describe()

,birthmonth,birthyear,highestgradecompleted,childathome,childnotathome,wageincome,nightlyhrssleep,satverbal,satmath,gpaoverall,...,weeksworked08,weeksworked09,weeksworked10,weeksworked11,weeksworked12,weeksworked13,weeksworked14,weeksworked15,weeksworked16,weeksworked17
count,8984.000000,8984.000000,6663.000000,4791.000000,4791.000000,5091.000000,6706.000000,1406.000000,1407.000000,6004.000000,...,8186.000000,8146.000000,8054.000000,7968.000000,7747.000000,7680.000000,7612.000000,7389.000000,7068.000000,6670.000000
mean,6.555988,1982.010352,14.059883,1.859320,0.410144,49477.022196,6.637340,499.724040,500.590618,281.840773,...,39.287564,37.419961,37.029923,37.911270,38.036918,38.791016,38.316999,39.605630,39.127476,39.016642
std,3.469429,1.396870,4.507592,1.259053,0.947590,40677.696798,1.364404,112.166256,114.953309,61.635667,...,19.041225,20.338602,20.822536,21.043442,21.115012,20.511653,21.000103,19.926533,21.336629,19.465974
min,1.000000,1980.000000,5.000000,0.000000,0.000000,0.000000,0.000000,14.000000,7.000000,10.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,3.000000,1981.000000,12.000000,1.000000,0.000000,25000.000000,6.000000,430.000000,430.000000,243.000000,...,30.000000,22.000000,20.000000,22.000000,22.000000,28.000000,23.000000,33.000000,23.000000,37.000000
50%,7.000000,1982.000000,14.000000,2.000000,0.000000,40000.000000,7.000000,500.000000,500.000000,286.000000,...,52.000000,52.000000,52.000000,53.000000,52.000000,52.000000,52.000000,52.000000,53.000000,49.000000
75%,10.000000,1983.000000,16.000000,3.000000,0.000000,62000.000000,8.000000,570.000000,580.000000,326.000000,...,52.000000,52.000000,52.000000,53.000000,52.000000,52.000000,52.000000,52.000000,53.000000,52.000000
max,12.000000,1984.000000,95.000000,9.000000,12.000000,235884.000000,20.000000,800.000000,800.000000,417.000000,...,52.000000,52.000000,52.000000,53.000000,52.000000,52.000000,52.000000,52.000000,53.000000,52.000000

In [5]:
# Demographic and employment data columns
democolumns = [
    "gender",
    "birthyear",
    "maritalstatus",
    "weeksworked16",
    "wageincome",
    "highestdegree",
]

nls97demo = nls97[democolumns]
nls97demo.index.name  # New dataframe retains the index of old data frame.

'personid'

In [6]:
# Select row 1000, 1001, 1002, 1003. Row 1004 is not included.
nls97demo[1000:1004].T

personid             195884          195891         195970         195996
gender                 Male            Male         Female         Female
birthyear              1981            1980           1982           1980
maritalstatus           NaN   Never-married  Never-married            NaN
weeksworked16           NaN            53.0           53.0            NaN
wageincome              NaN         14000.0        52000.0            NaN
highestdegree  4. Bachelors  2. High School   4. Bachelors  3. Associates

In [7]:
# Every 2 steps instead of 1. So only row 1000, 1002 will be selected.
nls97demo[1000:1004:2].T

personid             195884         195970
gender                 Male         Female
birthyear              1981           1982
maritalstatus           NaN  Never-married
weeksworked16           NaN           53.0
wageincome              NaN        52000.0
highestdegree  4. Bachelors   4. Bachelors

In [8]:
## Select first N rows.
# nls97demo[:3]
# nls97demo.head(3)

## Select last N rows.
# nls97demo[-3:]
# nls97demo.tail(3)

## Select by index personid
# nls97demo.loc[[195884, 195891, 195970]]
# nls97demo.loc[[195884:195970]]

## Select by position (similar as array)
nls97demo.iloc[[0, 1, 2]]

,gender,birthyear,maritalstatus,weeksworked16,wageincome,highestdegree
personid,,,,,,
100061,Female,1980,Married,48.0,12500.0,2. High School
100139,Male,1983,Married,53.0,120000.0,2. High School
100284,Male,1984,Never-married,47.0,58000.0,0. None

In [9]:
nls97["nightlyhrssleep"].head()

personid
100061    6.0
100139    8.0
100284    7.0
100292    NaN
100583    6.0
Name: nightlyhrssleep, dtype: float64

In [10]:
low_sleep_threshold = nls97["nightlyhrssleep"].quantile(0.33)
low_sleep_threshold  # 33% sleep less than 6 hours.

6.0

In [11]:
sleep_check_bool = nls97.nightlyhrssleep <= low_sleep_threshold
sleep_check_bool.head()

personid
100061     True
100139    False
100284    False
100292    False
100583     True
Name: nightlyhrssleep, dtype: bool

In [12]:
low_sleep = nls97.loc[sleep_check_bool]
low_sleep.shape

(3067, 88)

In [13]:
# We can create it in a single step.
low_sleep = nls97.loc[nls97.nightlyhrssleep <= low_sleep_threshold]
low_sleep.shape

(3067, 88)

In [14]:
# Passing complex condition. The & (AND) indicates both conditions have to be true.
# Using | (OR) means either condition can be true.
low_sleep_3plus_children = nls97.loc[
    (nls97.nightlyhrssleep <= low_sleep_threshold) & (nls97.childathome >= 3)
]
low_sleep_3plus_children.shape

(623, 88)

In [15]:
# Select both rows and columns.
low_sleep_3plus_children = nls97.loc[
    (nls97.nightlyhrssleep <= low_sleep_threshold) & (nls97.childathome >= 3),
    ["nightlyhrssleep", "childathome"],
]
low_sleep_3plus_children.shape

(623, 2)

## Generating frequencies for categorical features

Categorical features
- can be nominal or ordinal
- nominal (e.g. gender, country) have a limited number of possible values, can be numeric or string but has no intrinsic numerical meaning
- for ordinal, the order of the values matters

In [16]:
nls97abb = nls97.iloc[:, :20]
nls97abb.dtypes

gender                    object
birthmonth                 int64
birthyear                  int64
highestgradecompleted    float64
maritalstatus             object
childathome              float64
childnotathome           float64
wageincome               float64
weeklyhrscomputer         object
weeklyhrstv               object
nightlyhrssleep          float64
satverbal                float64
satmath                  float64
gpaoverall               float64
gpaenglish               float64
gpamath                  float64
gpascience               float64
highestdegree             object
govprovidejobs            object
govpricecontrols          object
dtype: object

In [17]:
# By default, NaN are excluded.
# But when analysing data, it is important to show it.
nls97abb.maritalstatus.value_counts(dropna=False)

Married          3066
Never-married    2766
NaN              2312
Divorced          663
Separated         154
Widowed            23
Name: maritalstatus, dtype: int64

In [18]:
nls97abb.maritalstatus.isnull().sum()

2312

In [19]:
# "maritalstatus" values are sorted by frequency.
# To sort alphabetically, we can use the index since value_counts returns a Series with the values as index.
marital_status_counts = nls97abb.maritalstatus.value_counts(dropna=False)
type(marital_status_counts)

pandas.core.series.Series

In [20]:
marital_status_counts.sort_index()

Divorced          663
Married          3066
Never-married    2766
Separated         154
Widowed            23
NaN              2312
Name: maritalstatus, dtype: int64

In [21]:
# To display the ratio, set "normalize=True"
nls97abb.maritalstatus.value_counts(dropna=False, normalize=True).sort_index()

Divorced         0.073798
Married          0.341273
Never-married    0.307881
Separated        0.017142
Widowed          0.002560
NaN              0.257346
Name: maritalstatus, dtype: float64

In [22]:
# Pandas has a "category" data type that can store data more efficiently than object.
# Most "object" columns contain categorical data, so we could convert it to "category"
# data type.
category_columns = nls97abb.select_dtypes(include=["object"]).columns
category_columns

Index(['gender', 'maritalstatus', 'weeklyhrscomputer', 'weeklyhrstv',
       'highestdegree', 'govprovidejobs', 'govpricecontrols'],
      dtype='object')

In [23]:
for col in nls97abb[category_columns].columns:
    nls97abb[col] = nls97abb[col].astype("category")

In [24]:
nls97abb[category_columns].dtypes

gender               category
maritalstatus        category
weeklyhrscomputer    category
weeklyhrstv          category
highestdegree        category
govprovidejobs       category
govpricecontrols     category
dtype: object

In [25]:
nls97abb[category_columns].isnull().sum()

gender                  0
maritalstatus        2312
weeklyhrscomputer    2274
weeklyhrstv          2273
highestdegree          31
govprovidejobs       7151
govpricecontrols     7125
dtype: int64

In [26]:
# To filter columns by pattern `like`
nls97abb.loc[nls97abb.maritalstatus == "Married"].filter(like="gov").apply(
    pd.value_counts, normalize=True
)

                   govprovidejobs  govpricecontrols
1. Definitely            0.173315          0.459864
2. Probably              0.328748          0.380952
3. Probably not          0.314993          0.112925
4. Definitely not        0.182944          0.046259

In [27]:
# Filter the columns directly.
nls97abb.loc[
    nls97abb.maritalstatus == "Married", ["govprovidejobs", "govpricecontrols"]
].apply(pd.value_counts, normalize=True)

                   govprovidejobs  govpricecontrols
1. Definitely            0.173315          0.459864
2. Probably              0.328748          0.380952
3. Probably not          0.314993          0.112925
4. Definitely not        0.182944          0.046259

In [28]:
# 95 is used as the missing value, hence we replace it with NaN.
nls97abb.highestgradecompleted.replace(95, np.nan, inplace=True)

In [29]:
nls97abb["highschoolgrad"] = np.where(
    nls97abb.highestgradecompleted.isnull(),
    np.nan,
    np.where(nls97abb.highestgradecompleted < 12, 0, 1),
)

In [30]:
# The highschoolgrad is pretty imbalanced.
nls97abb.groupby(["highschoolgrad"], dropna=False)["highestgradecompleted"].agg(
    ["min", "max", "size"]
)

                 min   max  size
highschoolgrad
0.0              5.0  11.0  1231
1.0             12.0  20.0  5421
NaN              NaN   NaN  2332

In [35]:
nls97abb["highgradegroup"] = pd.qcut(
    nls97abb["highestgradecompleted"], q=6, labels=[1, 2, 3, 4, 5, 6]
)
nls97abb.groupby(["highgradegroup"])["highestgradecompleted"].agg(
    ["min", "max", "size"]
)

                 min   max  size
highgradegroup
1                5.0  11.0  1231
2               12.0  12.0  1389
3               13.0  14.0  1288
4               15.0  16.0  1413
5               17.0  17.0   388
6               18.0  20.0   943

In [36]:
nls97abb["highgradegroup"] = nls97abb["highgradegroup"].astype("category")

## Generating summary statistics for continuous and discrete features.

Examine the following to understand how continuous feature is distributed
- central tendency (mean and median)
- shape (skewness and kurtosis)
- spread (range, interquartile range, variance and standard deviation)

In [38]:
import numpy as np
import pandas as pd
import scipy.stats as scistat

covid_totals = pd.read_csv("./data/covidtotals.csv", parse_dates=["lastdate"])
covid_totals.set_index("iso_code", inplace=True)
covid_totals.shape

(221, 16)

In [40]:
covid_totals.index.unique()

Index(['AFG', 'ALB', 'DZA', 'AND', 'AGO', 'AIA', 'ATG', 'ARG', 'ARM', 'ABW',
       ...
       'URY', 'UZB', 'VUT', 'VAT', 'VEN', 'VNM', 'WLF', 'YEM', 'ZMB', 'ZWE'],
      dtype='object', name='iso_code', length=221)

In [41]:
covid_totals.sample(2, random_state=6).T

iso_code                             ISL                  CZE
lastdate             2021-07-07 00:00:00  2021-07-07 00:00:00
location                         Iceland              Czechia
total_cases                       6555.0            1668277.0
total_deaths                        29.0              30311.0
total_cases_mill               19208.791           155782.968
total_deaths_mill                 84.982             2830.428
population                      341250.0           10708982.0
population_density                 3.404              137.176
median_age                          37.3                 43.3
gdp_per_capita                 46482.958            32605.906
aged_65_older                     14.431               19.027
total_tests_thous                    NaN                  NaN
life_expectancy                    82.99                79.38
hospital_beds_thous                 2.91                 6.63
diabetes_prevalence                 5.31                 6.82
region                    Western Europe       Western Europe

In [42]:
covid_totals.info()

<class 'pandas.core.frame.DataFrame'>
Index: 221 entries, AFG to ZWE
Data columns (total 16 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   lastdate             221 non-null    datetime64[ns]
 1   location             221 non-null    object
 2   total_cases          192 non-null    float64
 3   total_deaths         185 non-null    float64
 4   total_cases_mill     192 non-null    float64
 5   total_deaths_mill    185 non-null    float64
 6   population           221 non-null    float64
 7   population_density   206 non-null    float64
 8   median_age           190 non-null    float64
 9   gdp_per_capita       193 non-null    float64
 10  aged_65_older        188 non-null    float64
 11  total_tests_thous    13 non-null     float64
 12  life_expectancy      217 non-null    float64
 13  hospital_beds_thous  170 non-null    float64
 14  diabetes_prevalence  200 non-null    float64
 15  region               221 non-null    object
dtypes: datetime64[ns](1), float64(13), object(2)
memory usage: 37.5+ KB

In [43]:
key_vars = [
    "location",
    "total_cases_mill",
    "total_deaths_mill",
    "aged_65_older",
    "diabetes_prevalence",
]

covid_keys = covid_totals[key_vars]
covid_keys.describe()

       total_cases_mill  total_deaths_mill  aged_65_older  diabetes_prevalence
count        192.000000         185.000000     188.000000           200.000000
mean       36649.371823         683.136995       8.606995             8.442500
std        41403.975473         861.729323       6.122553             4.886392
min            8.521000           0.352000       1.144000             0.990000
25%         2499.746000          43.987000       3.496750             5.340000
50%        19525.726500         293.498000       6.217500             7.200000
75%        64834.619750        1087.893000      13.917500            10.612500
max       181466.382000        5876.013000      27.049000            30.530000

In [44]:
covid_keys.quantile(np.arange(0.0, 1.1, 0.1))

     total_cases_mill  total_deaths_mill  aged_65_older  diabetes_prevalence
0.0            8.5210             0.3520         1.1440                0.990
0.1          682.1292            10.6834         2.8007                3.298
0.2         1717.3932            30.2154         3.1600                4.788
0.3         3241.8389            66.2710         3.8572                5.741
0.4         9403.5800           145.0608         4.6856                6.698
0.5        19525.7265           293.4980         6.2175                7.200
0.6        33636.4690           556.4328         7.9346                8.318
0.7        55801.3275           949.7140        11.1869               10.080
0.8        74017.8108          1333.7872        14.9168               11.620
0.9        94072.1780          1868.8862        18.8459               13.752
1.0       181466.3820          5876.0130        27.0490               30.530

In [47]:
# To check if the features have normal distributions, that is
# they are distributed symmetrically (low skew) and have relatively
# normal tails (neither excessively high nor excessively low kurtosis).
#
# For Gaussian distribution, we expect a value near 0 for skew.
covid_keys.skew()

total_cases_mill       1.210127
total_deaths_mill      2.004572
aged_65_older          0.839370
diabetes_prevalence    1.524562
dtype: float64

In [48]:
# For Gaussian distribution, we expect a value near 3 for kurtosis.
covid_keys.kurtosis()

total_cases_mill       0.905631
total_deaths_mill      6.580832
aged_65_older         -0.557025
diabetes_prevalence    3.308697
dtype: float64

In [56]:
# Test each distribution's normality using Shapiro-Wilk test.
# Missing values needs to be dropped.
#
# We skip location since this only works for numeric data.
# p-value less than 0.5 means we can reject the null hypothesis of normal.
for var in key_vars[1:]:
    stat, p = scistat.shapiro(covid_keys[var].dropna())
    print(f"feature={var}\tp-value={p:.6f}")

feature=total_cases_mill	p-value=0.000000
feature=total_deaths_mill	p-value=0.000000
feature=aged_65_older	p-value=0.000000
feature=diabetes_prevalence	p-value=0.000000

## Identifying extreme values and outliers in univariante analysis

- outliers are unusual observations
- extreme values are not outliers
- extreme values can be identified by looking at its distance from the middle of the distribution (e.g. interquartile range)
- values more than 1.5 times the interquartile range above the third quartile or below the first quartile can be flag as extreme

In [58]:
covid_totals = pd.read_csv("./data/covidtotals.csv")
covid_totals.set_index("iso_code", inplace=True)

key_vars = [
    "location",
    "total_cases_mill",
    "total_deaths_mill",
    "aged_65_older",
    "diabetes_prevalence",
    "gdp_per_capita",
]
covid_keys = covid_totals[key_vars]
covid_keys.head()

,location,total_cases_mill,total_deaths_mill,aged_65_older,diabetes_prevalence,gdp_per_capita
iso_code,,,,,,
AFG,Afghanistan,3314.321,139.102,2.581,9.59,1803.987
ALB,Albania,46061.922,853.430,13.188,10.08,11803.431
DZA,Algeria,3261.770,86.338,6.211,6.73,13913.839
AND,Andorra,181466.382,1643.694,NaN,7.97,NaN
AGO,Angola,1201.566,28.144,2.405,3.94,5819.495

In [59]:
thirdq, firstq = covid_keys.total_cases_mill.quantile(
    0.75
), covid_keys.total_cases_mill.quantile(0.25)
inter_quantile_range = 1.5 * (thirdq - firstq)
extreme_value_high, extreme_value_low = (
    inter_quantile_range + thirdq,
    firstq - inter_quantile_range,
)
print(extreme_value_low, extreme_value_high, sep=" <--> ")

-91002.564625 <--> 158336.930375

In [60]:
covid_totals.loc[covid_totals.total_cases_mill > extreme_value_high].T

iso_code                        AND             MNE          SYC
lastdate                 2021-07-07      2021-07-07   2021-07-07
location                    Andorra      Montenegro   Seychelles
total_cases                 14021.0        100392.0      16304.0
total_deaths                  127.0          1619.0         71.0
total_cases_mill         181466.382      159844.092    165792.15
total_deaths_mill          1643.694        2577.771      721.985
population                  77265.0        628062.0      98340.0
population_density          163.755           46.28      208.354
median_age                      NaN            39.1         36.2
gdp_per_capita                  NaN       16409.288    26382.287
aged_65_older                   NaN          14.762        8.606
total_tests_thous               NaN             NaN          NaN
life_expectancy               83.73           76.88         73.4
hospital_beds_thous             NaN           3.861          3.6
diabetes_prevalence            7.97           10.08        10.55
region               Western Europe  Eastern Europe  East Africa